import MythViewer from "../components/MythViewer";
import MythBuilder from "../types/MythBuilder";

const builder = new MythBuilder();

builder.myth("양자역학은 난해함 때문에 진전이 더디다")`
아닙니다. 양자역학은 진전이 더디기는 커녕 오히려 근대에 등장한 학문 중에서 가장 성공한 학문 분야 중 하나입니다. 컴퓨터부터 시작해서 전자기기 중 90% 이상은 양자역학의 발전에 영향을 직간접적으로 받았다고 할 수 있습니다. 양자역학에서 탄생한 이론들은 현실에서의 실험 결과를 매우 잘 예측하며, 그 값도 아주 정확한 편에 속합니다.


다만 양자역학이 난해하다는 것 만큼은 사실인데, 이는 양자역학의 비직관성을 두고 하는 말입니다. 양자역학은 기존의 지식과 너무나도 다른 실험 결과를 내놓았으며, 이를 인정하지 않는 과학자들도 있었습니다. 그리고 그 기묘한 현상 중에는 아직까지도 해석이 되지 않은 부분들이 많습니다.

그래도 양자역학에서 사용되는 공식들의 결과가 정확하다는 것은 객관적인 사실입니다. 본질이 뭔지는 모르겠지만, 계산은 잘 되니 일단 써먹자는 것이죠. 양자역학의 본질을 읽어내기 위해서, 이론적으로 사용되는 값들과 개념들이 현실에서 어떤 의미를 지니는지 밝혀내기 위한 과학자들의 노력은 계속되고 있습니다.
`.myth("관찰자 효과는 우리의 의식과 관련된 현상이다")`
이중 슬릿 실험에서 보셨던 것처럼, 전자는 관측을 하기 전에는 파동처럼 행동하다가 관측을 하기 시작하면 입자처럼 행동합니다. 이렇게 관측의 여부에 따라 성질이 달라지는 것을 두고 '관찰자 효과'라고 합니다.

그런데 이 효과가 엉뚱맞은 곳에 쓰이는 경우가 많습니다. 자연 현상이 우리의 의식과 불가분하다는 증거다, 라고 하며 왜곡된 해석을 하는 경우도 있습니다. 하지만 관찰자 효과는 우리의 의식과는 전혀 무관한 현상입니다.

'우리가 전자의 상태를 관찰해서 알게된 것'이 전자의 성질을 바꾼 것이 아니라, '관측을 하는 행위' 자체가 전자의 성질을 바꾼 것입니다. 우리가 어떤 물체를 보기 위해서는 가시광선이 그 물체에 반사되어 우리의 눈에 도달해야 합니다. 전자도 마찬가지로 관측을 하기 위해서는 특정한 파장의 전자기파가 전자에 도달해야합니다.

그런데 거시 세계에서의 물체와는 다르게 전자는 아주 작은 물질이기 때문에 단순히 전자기파가 도달하는 것 만으로 큰 영향을 받을 수 있습니다(이와 관련된 원리로는 하이젠베르크의 '불확정성 원리'가 있습니다). 이 영향에 의해서 전자의 성질이 변화하는 것입니다. 우리의 의식이 전자의 상태에 대해서 알게된 것과는 전혀 상관이 없는 현상입니다.
`.myth("양자역학에 의해 뉴턴의 고전역학은 필요가 없어졌다")`
양자역학은 고전역학의 일반화입니다. 즉, 양자역학의 특수한 경우(거시적인 경우)가 고전역학에 해당하는 것입니다. 양자역학에서 사용되는 공식에서 특정한 변수에 아주 큰 값(거시적인 값)을 취하면 고전역학의 공식이 나오게 됩니다.

엄밀히 말하자면, 양자역학에 의해서 뉴턴의 고전역학이 틀렸음이 증명된 것은 맞습니다. 하지만 그 오차는 원자 단위의 수준이며 실용적으로, 아니 이론적으로도 무시해도 될 수준의 오차입니다.

우리가 일상 생활에서 키를 잴 때 특수 상대성 이론에 나오는 길이 수축 현상을 고려하여 재지는 않습니다. 마찬가지로 거시 세계의 현상에 있어서는 뉴턴의 고전역학으로도 충분히 정밀하고 실용성 있는 결과를 내놓을 수 있습니다. 따라서 양자역학에 의해 고전역학이 쓸모 없어졌다는 말은 옳지 않습니다.
`.myth("아인슈타인은 양자역학을 부정했다")`
아인슈타인은 양자역학을 만든 사람 중 한 명입니다. 아인슈타인은 광전 효과 이론과 함께 광자라는 개념을 도입하여 양자역학의 시대를 열었습니다.

아인슈타인이 양자역학 자체를 부정했다기 보다는, 당시에 유력한 이론으로 떠올랐던 양자역학의 해석 중 하나인 코펜하겐 해석을 부정했다고 보는 것이 맞습니다. 특히 그는 그가 주창한 특수 상대성 이론에 위배되는 비국소성(non-locality)에 대한 내용을 적극적으로 반박했습니다.

하지만 현재는 코펜하겐 해석을 받아들이는 과학자가 절대적인 다수이며, 아인슈타인의 논리는 틀렸음이 밝혀졌습니다. 하지만 그런 과학적인 토론이 오가는 과정에서 양자역학의 이론에서 부족한 부분들이 많이 강화되었으며 역설적이게도 아인슈타인은 양자역학에 가장 많은 공헌을 한 과학자 중 한 명으로 남게 되었습니다.
`;

export default function Myth1Page() {
  return <MythViewer chapter={3} index={1} myths={builder.build()} />;
}
